// ১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো
// let numbers = [10, 20, 30, 40, 50, 60, 70, 80, 85, 100];
// for (const number of numbers) {
//     if (number > 50) {
//         console.log(number)
//     }

// }
/////////////////////////////////////////////////////////////////////////////////////////////////////////

// ১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউটপুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো।


// function Gunnfol(numbersOne, numberTow, NumberThree) {
//     let result = numbersOne * numberTow * NumberThree
//     return result;


// }
// console.log(Gunnfol(12, 45, 67))

///////////////////////////////////////////////////////////////////////////////////////////////////////


// ১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা।

// var objectAddic = { name: 'abul', age: "23", color: 'black' }

// objectAddic.age = '25'
// console.log(objectAddic)


///////////////////////////////////////////////////////////////////////////////////////////////////////////


// ১. সিম্পল একটা ফাংশন লিখতে হবে। যেটার নাম হবে feetToInch এবং এই ফাংশন ইনপুট হিসেবে নিবে feet আর রিটার্ন করবে inch । অর্থাৎ এই ফাংশনকে কোন একটা ফিট বলে দিলে সে রিটার্ন হিসেবে বলে দিবে কত ইঞ্চি হয়।


// function feetToInch(feet) {
//     var Inch = feet * 12;
//     return Inch

// }
// var result = feetToInch(10);
// console.log(result)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////


// ২. একদম ফাংশন এর নাম হুবহু centimeterToMeter নাম দিয়ে একটা ফাংশন লিখবে। এই ফাংশনে ইনপুট হিসাবে কেউ সেন্টিমিটার দিবে আর সেই সেন্টিমিটার কে মিটার এ কনভার্ট করে রেজাল্ট রিটার্ন করবে।
//
// function centimeterToMeter(centimeter) {
//     var meter = centimeter * 0.01;
//     return meter;
// }

// var result = centimeterToMeter(500065645);
// console.log(result.toFixed(2));


//////////////////////////////////////////////////////////////////////////////////////////////////////////////


// ৩. আরেকটা ফাংশন লিখবে যেটার নাম লিখবে। যেই ফাংশনের নাম হবে paperRequirements এই ফাংশনের প্যারামিটার হিসেবে তিনটা প্যারামিটার হবে। প্রথম প্যারামিটার হবে তুমি প্রথম বই কত কপি ছাপাতে চাও। সেকেন্ড প্যারামিটার হবে তুমি সেকেন্ড বই কত কপি ছাপাতে চাও। আর থার্ড প্যারামিটার হবে তুমি থার্ড বই কত কপি ছাপাতে চাও। অর্থাৎ কোন বই এর কত কপি ছাপানো হবে সেটাই প্যারামিটার হিসেবে নিবে।

// এইবার ভালো করে খেয়াল করো।

// প্রথম বই ছাপানোর জন্য পৃষ্ঠা লাগবে ১০০ টা

// সেকেন্ড বই ছাপানোর জন্য পৃষ্ঠা লাগবে ২০০ টা

// তৃতীয় বই ছাপানোর জন্য পৃষ্ঠা লাগবে ৩০০ টা



// এখন তোমার কাজ হচ্ছে paperRequirements নামক ফাংশন লিখে ফেলা যাতে। সেই ফাংশনকে কল করে কোন বই এর কত কপি লাগবে বলে দিবে প্যারামিটার হিসেবে। আর ফাংশন হিসাব করে বলে দিবে তোমার সর্বমোট কতপৃষ্ঠা কাগজ লাগবে।

// উত্তর হিসেবে সংখ্যা রিটার্ন করবে।


// function paperRequirements(bookOne, bookTow, bookThree) {
//     let firsBook = bookOne * 100;
//     let secendBook = bookTow * 200;
//     let thirdBook = bookThree * 300
//     let totalPagesNeed = firsBook + secendBook + thirdBook;
//     return totalPagesNeed
// }

// let myTotalPages = paperRequirements(1, 1, 1)
// console.log(myTotalPages)


///////////////////////////////////////////////////////////////////////////////////////////////////////////////


// ৪. একটা ফাংশন লিখবে। এই ফাংশনের নাম হবে bestFriend তারপর সেই ফাংশনে ইনপুট প্যারামিটার হিসেবে একটা array নিবে। সেই array এর মধ্যে তোমার সব ফ্রেন্ডের নাম থাকবে। এখন তোমার কাজ হচ্ছে যে ফ্রেন্ড এর নাম সবচেয়ে বড় সেই ফ্রেন্ড এর নাম রিটার্ন করে দেয়া। এই ক্ষেত্রে তুমি নামটা অর্থাৎ ফ্রেন্ডের নাম (স্ট্রিং) রিটার্ন করতে হবে।

// function bestFriend(Names) {
//     let bigName = "";
//     for (let i = 0; i < Names.length; i++) {
//         let name = Names[i];
//         if (name.length > bigName.length)
//             bigName = name;

//     }
//     return bigName
// }
// let myFriend = ["akil ahmed", "abdul mannan", "inam ahmed chodory"];
// let result = bestFriend(myFriend);
// console.log(result)

///////////////////////////////////////////////////////////////////////////////////////////////////////////////



// ৫. এইটা একটু ট্রিকি হতে পারে। একটা array এর মধ্যে অনেকগুলা সংখ্যা থাকবে। তোমার কাজ হচ্ছে সংখ্যা গুলা একটার পর একটা করে চেক করা। এবং সংখ্যা গুলা যদি পজিটিভ সংখ্যা হয়। অর্থাৎ শূন্য বা শূন্যের চাইতে বড় হয় তাহলে সেগুলাকে কোন একটা array এর মধ্যে রাখবে। আর যদি নেগেটিভ সংখ্যা হয়। তাহলে লুপটা স্টপ করে দিবে। এবং লুপ বন্ধ করার আগ পর্যন্ত যতগুলা পজিটিভ সংখ্যা পাওয়া গেছে। সেগুলা রিটার্ন করে দিবে।

// function getPossitiveNumber(Numbers) {
//     let possitiveNumbers = [];
//     for (const number of Numbers) {
//         if (number >= 0) {
//             possitiveNumbers.push(number);
//         }
//         else {
//             break;
//         }
//     }
//     return possitiveNumbers;
// }
// let pNumberOrNnumber = [0, 1, 2, 3, 4, 66, 77, 87,]
// let result = getPossitiveNumber(pNumberOrNnumber)
// console.log(result)


//////////////////////////////////////////////////////////////////////////////////////////////////////////////